input = [4, 6, 2, 9, 1]

# [4, 6, 2, 9, 1]
#   -> -> -> ->
# [4, 2, 6, 1, 9]
#   -> -> ->
# [2, 4, 1, 6, 9]
#   -> ->
# [2, 1, 4, 6, 9]
#   ->
# [1, 2, 4, 6, 9]
#>> 화살표: 반복문 == 4번, 3번, 2번, 1번. / 4번 돌고 끝이 났다.(input-1만큼)
# for i in range(5 - 1):
# range(4) (
def bubble_sort(array):
    n = len(array)  # n = 5
    for i in range(n - 1):  # 화살표 반복문   # i = 0, 1, 2, 3
        for j in range(n - i - 1):  # j = 0, 1, 2, 3/ j = 0, 1, 2/ j = 0, 1/ j= 0
            if array[j] > array[j + 1]: # 앞 숫자가 더 크면
                array[j], array[j + 1] = array[j + 1], array[j] # 바꾸기
            print(j)    # j = 인덱스!
            # i = 0일때 [4, 6, 2, 9, 1]/[4, 2, 6, 9, 1]/[4, 2, 6, 1, 9]
            # i = 1일때 [2, 4, 6, 1, 9]/[2, 4, 1, 6, 9]
            # i = 2일때 [2, 4, 1, 6, 9]/[2, 1, 4, 6, 9]
            # i = 3일때 [1, 2, 4, 6, 9]
    return

bubble_sort(input)
print(input)  # [1, 2, 4, 6, 9] 가 되어야 합니다!